app/controllers/likes_controller.rb

  def create
  if already_liked?
    flash[:notice] = "You can't like more than once"
  else
    @post.likes.create(user_id: current_user.id)
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 23], ["user_id", 2], ["created_at", "2019-11-01 21:11:18.465139"], ["updated_at", "2019-11-01 21:11:18.465139"]]

  def destroy
  if !(already_liked?)
    flash[:notice] = "Cannot unlike"
  else
    @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 5]]

  def already_liked?
  Like.where(user_id: current_user.id, post_id:
  params[:post_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 23], ["LIMIT", 1]]

  def find_like
   @like = @post.likes.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."id" = ? LIMIT ?  [["post_id", 23], ["id", 5], ["LIMIT", 1]]